simulations/cfd/phaseforge_channel_3d_hpht/constant/transportProperties.hpht
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// HPHT thermal-property analogue (~150 C liquid). Incompressible VoF.
// 10,000 psi is NOT modelled as a chemical rate.

phases (water oil);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 2.0e-07;
    rho             [1 -3 0 0 0 0 0] 917;
}

oil
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 3.2e-07;
    rho             [1 -3 0 0 0 0 0] 880;
}

sigma           [1 0 -2 0 0 0 0] 0.0032;

// ************************************************************************* //
