simulations/cfd/phaseforge_channel_3d_hpht/system/blockMeshDict.coarse
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (20.0 0 0)
    (20.0 3.0 0)
    (0 3.0 0)
    (0 0 2.0)
    (20.0 0 2.0)
    (20.0 3.0 2.0)
    (0 3.0 2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (160 24 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// True 3D duct: four long faces are walls (noSlip). No empty patch.
// ************************************************************************* //
